1

In [ ]:
select * from PERSON;
select * from DEPARTMENT;
select * from POSITION;
--2
select NAME_, SURNAME, BIRTHDATE from PERSON where GENDER = 'K';

--3
select NAME_, SURNAME, INDATE from PERSON where INDATE > '2017-01-01';

--4
insert into PERSON values('1781','12345678901','Esma','Sultan','K','1980-01-01','2017-02-03',NULL,4,38,28,922,'(0282) 2628699', 10000);

--5
select * from PERSON;

update PERSON set SALARY=6000 where NAME_='Ferhat' and SURNAME='CINAR';

--6
select * from PERSON where NAME_='Deniz' and SURNAME='ERAVCI';

delete from PERSON where NAME_='Deniz' and SURNAME='ERAVCI';

--7
select NAME_, SURNAME, BIRTHDATE from PERSON where BIRTHDATE < '1960-01-01';

--8
select NAME_, SURNAME, BIRTHDATE, SALARY from PERSON where BIRTHDATE < '1960-01-01' and SALARY > 5000;

--9
select NAME_, SURNAME, DEPARTMENTID, SALARY from PERSON where DEPARTMENTID=4 and SALARY > 5500;

--10
select * from PERSON where OUTDATE is NULL;

update PERSON set SALARY = SALARY * 1.10 where OUTDATE is NULL;

--11
select * from PERSON where INDATE < '2015-01-01' and SALARY < 5000;

--12
select distinct DEPARTMENTID from PERSON;

--13
select * from DEPARTMENT;

select NAME_, SURNAME, SALARY from PERSON ORDER BY SALARY DESC;

--14
select TOP(5) NAME_, SURNAME, SALARY from PERSON ORDER BY SALARY DESC;